package duplenskikh.homework.pussy_feeder;

/*
Создать массив, который будет отображать количество корма для котов. То есть если food[1] = 5,
то у черного кота под номером 1 будет пять пакетиков еды.
Сама задача:
Создать функции, которые позволяют:
добавить или убавить еды у конкретного кота
добавить или убавить еды у всех котов сразу
добавить или убавить еды у четных или нечетных котов

Только надо класс подготовить, со статик массивом

по аналогии с задачей "угадай число"
цикл ввод, пока пользователь не введет число 666
то есть как ввел 666, то выйти из программы
в миске не может быть меньше 0 и больше 7 пакетиков корма

после ввода программа каждый раз выводит у кого сколько корма и меню
*/
public class Main {
    public static void main(String[] args) {

    }
}
